#include <stdio.h>
#include <math.h>
int main()
{
	//1)Градусы-радианы
	double g; //Значение угла в градусах 
	double r; //Значение угла в радианах

	printf("1)\na(gr) = ");
	scanf_s("%lf", &g); //Ввод значение угла в градусах 
	r = (g * 3.14) / 180; //Вычисление радиан
	printf("a(rd) = %lf", r); //Вывод результата


	//2)Радианы-градусы
	double r1; //Значение угла в радианах
	double g1; //Значение угла в градусах 

	printf("\n\n2)\na(rd) = ");
	scanf_s("%lf", &r1); //Ввод значение угла в радианах 
	g1 = (r1 * 180) / 3.14; //Вычисление градусов
	printf("a(gr) = %lf", g1); //Вывод результата


	//3)Рубли за кг
	double a, b, c; //Цена А за Х кг, цена В за У кг, цена за 1 кг
	double x, y; //Х кг и У кг 

	printf("\n\n3)\nX kg = ");
	scanf_s("%lf", &x); //Ввод Х кг
	printf("A(X) rub = ");
	scanf_s("%lf", &a); //Ввод цены А руб за Х кг
	printf("Y kg = ");
	scanf_s("%lf", &y); //Ввод У кг 
	c = a / x; //Цена за 1 кг
	b = c * y; //Вычисление цены В руб за У кг
	printf("1 kg = %lf rub\n%lf kg = %lf rub", c, y, b); //Вывод результата


	//4)Расстояние между автомобилями
	double u1, u2; //Скорость 1-го и 2-го автомобилей
	double s, st; //Начальное расстояние и расстояние через T часов
	double t; //T часов
	double s1, s2; //Расстояние, которое проедет каждый из автомобилей за T часов

	printf("\n\n3)\nU1 (km/h) = ");
	scanf_s("%lf", &u1); //Ввод скорости 1-го автомобиля
	printf("U2 (km/h) = ");
	scanf_s("%lf", &u2); //Ввод скорости 2-го автомобиля
	printf("S (km) = ");
	scanf_s("%lf", &s); //Ввод начального расстояния между автомобилями
	printf("T (h) = ");
	scanf_s("%lf", &t); //Ввод часов
	s1 = u1 * t; //Расстояние, которое проедет 1-ый автомобиль за T часов
	s2 = u2 * t; //Расстояние, которое проедет 2-ый автомобиль за T часов
	st = s + s1 + s2; //Расстояние между автомобилями через T часов
	printf("S = %lf km", st); //Вывод результата


	//5)A•x + B = 0
	double a3, b3; //Kоэффициенты A и B
	double x3; //x

	printf("\n\n3)\nA = ");
	scanf_s("%lf", &a3); //Ввод A
	printf("B = ");
	scanf_s("%lf", &b3); //Ввод B
	if (a3 != 0)
	{
		x3 = -b3 / a3;
		printf("x = %lf", x3); //Вывод результата
	}
	else
	{
		if (b3 == 0)
		{
			printf("x - Luboe chislo"); //Вывод результата
		}
		else
		{
			printf("Reshehiy net"); //Вывод результата
		}
	}


	//6)A1•x + B1•y = C1, 
	  //A2•x + B2•y = C2,
	double a1, b1; //Kоэффициенты A1 и B1
	double a2, b2; //Kоэффициенты A2 и B2
	double c1, c2; // C1 и C2
	double x1, y1; //x и y
	double d, dx, dy; //Вспомогательные переменные

	printf("\n\n3)\nA1 = ");
	scanf_s("%lf", &a1); //Ввод A1
	printf("B1 = ");
	scanf_s("%lf", &b1); //Ввод B1 
	printf("C1 = ");
	scanf_s("%lf", &c1); //Ввод C1
	printf("A2 = ");
	scanf_s("%lf", &a2); //Ввод A2
	printf("B2 = ");
	scanf_s("%lf", &b2); //Ввод B2
	printf("C2 = ");
	scanf_s("%lf", &c2); //Ввод C2
	d = a1 * b2 - b1 * a2;
	dx = c1 * b2 - b1 * c2;
	dy = a1 * c2 - c1 * a2;
	if (d == 0)
	{
		if ((a1 == 0 && b1 == 0 && c1 != 0) || (a2 == 0 && b2 == 0 && c2 != 0) || ((a1 != 0 && b1 != 0 && c1 == 0) && (a2 != 0 && b2 != 0 && c2 != 0)) || ((a1 != 0 && b1 != 0 && c1 != 0) && (a2 != 0 && b2 != 0 && c2 == 0)) || (a1 == 0 && a2 == 0 && b1 != 0 && b2 != 0 && c1 / b1 != c2 / b2) || (b1 == 0 && b2 == 0 && a1 != 0 && a2 != 0 && c1 / a1 == c2 / a2))
		{
			printf("Reshehiy net\n"); //Вывод результата
		}
		if (a1 == 0 && a2 == 0 && b1 != 0 && b2 != 0 && c1 / b1 == c2 / b2)
		{
			y1 = c1 / b1;
			printf("x - Luboe chislo\ny = %lf\n", y1); //Вывод результата
		}
		if (b1 == 0 && b2 == 0 && a1 != 0 && a2 != 0 && c1 / a1 == c2 / a2)
		{
			x1 = c1 / a1;
			printf("x = %lf\ny - Luboe chislo\n", x1); //Вывод результата
		}
	}
	else
	{
		x1 = dx / d;
		y1 = dy / d;
		printf("x = %lf\ny = %lf\n", x1, y1); //Вывод результата
	}
}